{"modelTopology": {"keras_version": "2.1.2", "backend": "tensorflow", "training_config": {"loss_weights": {"policy_head": 0.5, "value_head": 0.5}, "sample_weight_mode": null, "metrics": null, "loss": {"policy_head": "softmax_cross_entropy_with_logits", "value_head": "mean_squared_error"}, "optimizer_config": {"config": {"decay": 0.0, "nesterov": false, "lr": 0.10000000149011612, "momentum": 0.8999999761581421}, "class_name": "SGD"}}, "model_config": {"config": {"layers": [{"inbound_nodes": [], "config": {"name": "main_input", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 2, 3, 3]}, "name": "main_input", "class_name": "InputLayer"}, {"inbound_nodes": [[["main_input", 0, 0, {}]]], "config": {"name": "conv2d_14", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_14", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_14", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_14", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_15", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_15", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"name": "conv2d_15", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_15", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_15", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_15", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_16", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_16", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"name": "conv2d_16", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_16", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_16", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_16", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "class_name": "Add"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_17", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_17", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "config": {"name": "conv2d_17", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_17", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_17", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_17", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_18", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_18", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "config": {"name": "conv2d_18", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_18", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_18", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_18", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "class_name": "Add"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_19", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_19", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "config": {"name": "conv2d_19", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_19", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_19", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_19", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_20", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_20", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]], "config": {"name": "conv2d_20", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_20", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_20", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_20", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}], ["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "class_name": "Add"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_21", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_21", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "config": {"name": "conv2d_21", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_21", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_21", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_21", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_22", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_22", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]], "config": {"name": "conv2d_22", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_22", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_22", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_22", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}, "name": "add_9", "class_name": "Add"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_23", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_23", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]], "config": {"name": "conv2d_23", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_23", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_23", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_23", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_24", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_24", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]], "config": {"name": "conv2d_24", "activation": "linear", "kernel_size": [4, 4], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_24", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_24", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_24", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}], ["batch_normalization_24", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}, "name": "add_10", "class_name": "Add"}, {"inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_25", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_25", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]], "config": {"name": "conv2d_25", "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_25", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_25", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_25", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_26", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_26", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]], "config": {"name": "conv2d_26", "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "filters": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_constraint": null}, "name": "conv2d_26", "class_name": "Conv2D"}, {"inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3", "class_name": "Flatten"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_26", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null, "axis": 1, "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "center": true}, "name": "batch_normalization_26", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "units": 20, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_28", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_28", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"trainable": true, "name": "leaky_re_lu_27", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_27", "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_4"}, "name": "flatten_4", "class_name": "Flatten"}, {"inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]], "config": {"name": "value_head", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}}, "name": "value_head", "class_name": "Dense"}, {"inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"name": "policy_head", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": false, "bias_regularizer": null, "units": 9, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}}, "name": "policy_head", "class_name": "Dense"}], "name": "model_2", "input_layers": [["main_input", 0, 0]], "output_layers": [["value_head", 0, 0], ["policy_head", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_14/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_14/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_14/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_14/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_15/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_15/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_15/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_15/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_16/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_16/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_16/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_16/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_17/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_17/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_17/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_17/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_18/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_18/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_18/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_18/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_19/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_19/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_19/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_19/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_20/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_20/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_20/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_20/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_21/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_21/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_21/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_21/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_22/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_22/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_22/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_22/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_23/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_23/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_23/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_23/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_24/gamma", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_24/beta", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_24/moving_mean", "dtype": "float32", "shape": [75]}, {"name": "batch_normalization_24/moving_variance", "dtype": "float32", "shape": [75]}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_25/gamma", "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_25/beta", "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_25/moving_mean", "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_25/moving_variance", "dtype": "float32", "shape": [1]}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "batch_normalization_26/gamma", "dtype": "float32", "shape": [2]}, {"name": "batch_normalization_26/beta", "dtype": "float32", "shape": [2]}, {"name": "batch_normalization_26/moving_mean", "dtype": "float32", "shape": [2]}, {"name": "batch_normalization_26/moving_variance", "dtype": "float32", "shape": [2]}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_14/kernel", "dtype": "float32", "shape": [4, 4, 2, 75]}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_15/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv2d_16/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv2d_17/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv2d_18/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv2d_19/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv2d_20/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv2d_21/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv2d_22/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv2d_23/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv2d_24/kernel", "dtype": "float32", "shape": [4, 4, 75, 75]}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "conv2d_25/kernel", "dtype": "float32", "shape": [1, 1, 75, 1]}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "conv2d_26/kernel", "dtype": "float32", "shape": [1, 1, 75, 2]}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [9, 20]}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "policy_head_1/kernel", "dtype": "float32", "shape": [18, 9]}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "value_head_1/kernel", "dtype": "float32", "shape": [20, 1]}]}]}