{"modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "padding": "same", "strides": [1, 1], "filters": 16, "name": "conv2d_1", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "strides": [1, 1], "filters": 32, "name": "conv2d_2", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "strides": [1, 1], "filters": 64, "name": "conv2d_3", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "dtype": "float32", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 128, "activation": "relu", "name": "dense_1", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 100, "activation": "softmax", "name": "dense_2", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.1.5-tf"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d/kernel", "shape": [3, 3, 1, 16]}, {"dtype": "float32", "name": "conv2d/bias", "shape": [16]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 16, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "dense/kernel", "shape": [576, 128]}, {"dtype": "float32", "name": "dense/bias", "shape": [128]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [128, 100]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [100]}]}]}