{"modelTopology": {"training_config": {"metrics": [], "loss": {"policy_head": "softmax_cross_entropy_with_logits", "value_head": "mean_squared_error"}, "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 0.10000000149011612, "momentum": 0.8999999761581421, "decay": 0.0}}, "sample_weight_mode": null, "loss_weights": {"policy_head": 0.5, "value_head": 0.5}}, "keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 2, 3, 3], "name": "main_input", "sparse": false}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["main_input", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_3"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_5"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "leaky_re_lu_6"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_7"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_8"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "leaky_re_lu_8"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_9"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "leaky_re_lu_9"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_10"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "leaky_re_lu_10"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "kernel_constraint": null, "filters": 75, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_11"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "leaky_re_lu_11"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "kernel_constraint": null, "filters": 1, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_12"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "leaky_re_lu_12"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "kernel_constraint": null, "filters": 2, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activation": "linear", "kernel_size": [1, 1]}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": false, "activation": "linear"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_14"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "leaky_re_lu_14"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_13"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "leaky_re_lu_13"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "value_head", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activation": "tanh"}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "value_head"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "policy_head", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "use_bias": false, "activation": "linear"}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "policy_head"}], "output_layers": [["value_head", 0, 0], ["policy_head", 0, 0]], "name": "model_1", "input_layers": [["main_input", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_10/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_11/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [1], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [1], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [1], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [1], "name": "batch_normalization_12/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [2], "name": "batch_normalization_13/gamma"}, {"dtype": "float32", "shape": [2], "name": "batch_normalization_13/beta"}, {"dtype": "float32", "shape": [2], "name": "batch_normalization_13/moving_mean"}, {"dtype": "float32", "shape": [2], "name": "batch_normalization_13/moving_variance"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_3/moving_variance"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_4/moving_variance"}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_5/moving_variance"}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_6/moving_variance"}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_7/moving_variance"}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_8/moving_variance"}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_9/moving_variance"}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 2, 75], "name": "conv2d_1/kernel"}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_10/kernel"}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_11/kernel"}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 75, 1], "name": "conv2d_12/kernel"}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 75, 2], "name": "conv2d_13/kernel"}]}, {"paths": ["group19-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_2/kernel"}]}, {"paths": ["group20-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_3/kernel"}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_4/kernel"}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_5/kernel"}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_6/kernel"}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_7/kernel"}]}, {"paths": ["group25-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_8/kernel"}]}, {"paths": ["group26-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_9/kernel"}]}, {"paths": ["group27-shard1of1"], "weights": [{"dtype": "float32", "shape": [9, 20], "name": "dense_1/kernel"}]}, {"paths": ["group28-shard1of1"], "weights": [{"dtype": "float32", "shape": [18, 9], "name": "policy_head/kernel"}]}, {"paths": ["group29-shard1of1"], "weights": [{"dtype": "float32", "shape": [20, 1], "name": "value_head/kernel"}]}]}