{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "main_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 3, 3], "dtype": "float32", "sparse": false, "name": "main_input"}, "inbound_nodes": []}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["main_input", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "leaky_re_lu_15", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "leaky_re_lu_16", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]]}, {"name": "leaky_re_lu_17", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "leaky_re_lu_18", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]]}, {"name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}], ["batch_normalization_20", 0, 0, {}]]]}, {"name": "leaky_re_lu_21", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "leaky_re_lu_22", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]]}, {"name": "leaky_re_lu_23", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "leaky_re_lu_24", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 75, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}], ["batch_normalization_24", 0, 0, {}]]]}, {"name": "leaky_re_lu_25", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_26", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 20, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]]}, {"name": "value_head", "class_name": "Dense", "config": {"name": "value_head", "trainable": true, "units": 1, "activation": "tanh", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "policy_head", "class_name": "Dense", "config": {"name": "policy_head", "trainable": true, "units": 9, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}], "input_layers": [["main_input", 0, 0]], "output_layers": [["value_head", 0, 0], ["policy_head", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 0.10000000149011612, "momentum": 0.8999999761581421, "decay": 0.0, "nesterov": false}}, "loss": {"value_head": "mean_squared_error", "policy_head": "softmax_cross_entropy_with_logits"}, "metrics": [], "sample_weight_mode": null, "loss_weights": {"value_head": 0.5, "policy_head": 0.5}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_14/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_15/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_16/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_17/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_18/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_19/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_20/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_21/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_22/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_23/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_24/gamma", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [75], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [75], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_25/gamma", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [1], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "batch_normalization_26/gamma", "shape": [2], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [2], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [2], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [2], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_14/kernel", "shape": [4, 4, 2, 75], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_15/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv2d_16/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv2d_17/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv2d_18/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv2d_19/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv2d_20/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv2d_21/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "conv2d_22/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv2d_23/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv2d_24/kernel", "shape": [4, 4, 75, 75], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "conv2d_25/kernel", "shape": [1, 1, 75, 1], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "conv2d_26/kernel", "shape": [1, 1, 75, 2], "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [9, 20], "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "policy_head_1/kernel", "shape": [18, 9], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "value_head_1/kernel", "shape": [20, 1], "dtype": "float32"}]}]}