{"modelTopology": {"training_config": {"metrics": [], "loss": {"policy_head": "softmax_cross_entropy_with_logits", "value_head": "mean_squared_error"}, "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 0.10000000149011612, "momentum": 0.8999999761581421, "decay": 0.0}}, "sample_weight_mode": null, "loss_weights": {"policy_head": 0.5, "value_head": 0.5}}, "keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 2, 3, 3], "name": "main_input", "sparse": false}, "name": "main_input"}, {"class_name": "Conv2D", "inbound_nodes": [[["main_input", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_14"}, "name": "conv2d_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_14"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_15"}, "name": "leaky_re_lu_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_15"}, "name": "conv2d_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_15"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_16"}, "name": "leaky_re_lu_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_16"}, "name": "conv2d_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_16"}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_17"}, "name": "leaky_re_lu_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_17"}, "name": "conv2d_17"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_17"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_18"}, "name": "leaky_re_lu_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_18"}, "name": "conv2d_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_18"}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "name": "add_7"}, "name": "add_7"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_19"}, "name": "leaky_re_lu_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_19"}, "name": "conv2d_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_19"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_20"}, "name": "leaky_re_lu_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_20"}, "name": "conv2d_20"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_20"}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}], ["batch_normalization_20", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8"}, "name": "add_8"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_21"}, "name": "leaky_re_lu_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_21"}, "name": "conv2d_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_21"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_22"}, "name": "leaky_re_lu_22"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_22"}, "name": "conv2d_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_22"}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}, "name": "add_9"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_23"}, "name": "leaky_re_lu_23"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_23"}, "name": "conv2d_23"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_23"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_24"}, "name": "leaky_re_lu_24"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 75, "use_bias": false, "activity_regularizer": null, "kernel_size": [4, 4], "name": "conv2d_24"}, "name": "conv2d_24"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_24"}, {"class_name": "Add", "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}], ["batch_normalization_24", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}, "name": "add_10"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_25"}, "name": "leaky_re_lu_25"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 1, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_25"}, "name": "conv2d_25"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_25"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_26"}, "name": "leaky_re_lu_26"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "filters": 2, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_26"}, "name": "conv2d_26"}, {"class_name": "Flatten", "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "name": "batch_normalization_26"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": false, "activity_regularizer": null, "name": "dense_2"}, "name": "dense_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_28"}, "name": "leaky_re_lu_28"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_27"}, "name": "leaky_re_lu_27"}, {"class_name": "Flatten", "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_4"}, "name": "flatten_4"}, {"class_name": "Dense", "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null, "name": "value_head"}, "name": "value_head"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "use_bias": false, "activity_regularizer": null, "name": "policy_head"}, "name": "policy_head"}], "input_layers": [["main_input", 0, 0]], "name": "model_2", "output_layers": [["value_head", 0, 0], ["policy_head", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_14/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_14/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_14/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_14/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_15/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_15/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_15/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_15/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_16/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_16/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_16/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_16/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_17/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_17/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_17/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_17/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_18/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_18/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_18/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_18/moving_variance"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_19/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_19/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_19/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_19/moving_variance"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_20/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_20/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_20/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_20/moving_variance"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_21/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_21/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_21/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_21/moving_variance"}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_22/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_22/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_22/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_22/moving_variance"}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_23/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_23/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_23/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_23/moving_variance"}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "shape": [75], "name": "batch_normalization_24/gamma"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_24/beta"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_24/moving_mean"}, {"dtype": "float32", "shape": [75], "name": "batch_normalization_24/moving_variance"}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "shape": [1], "name": "batch_normalization_25/gamma"}, {"dtype": "float32", "shape": [1], "name": "batch_normalization_25/beta"}, {"dtype": "float32", "shape": [1], "name": "batch_normalization_25/moving_mean"}, {"dtype": "float32", "shape": [1], "name": "batch_normalization_25/moving_variance"}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "shape": [2], "name": "batch_normalization_26/gamma"}, {"dtype": "float32", "shape": [2], "name": "batch_normalization_26/beta"}, {"dtype": "float32", "shape": [2], "name": "batch_normalization_26/moving_mean"}, {"dtype": "float32", "shape": [2], "name": "batch_normalization_26/moving_variance"}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 2, 75], "name": "conv2d_14/kernel"}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_15/kernel"}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_16/kernel"}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_17/kernel"}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_18/kernel"}]}, {"paths": ["group19-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_19/kernel"}]}, {"paths": ["group20-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_20/kernel"}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_21/kernel"}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_22/kernel"}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_23/kernel"}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 75, 75], "name": "conv2d_24/kernel"}]}, {"paths": ["group25-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 75, 1], "name": "conv2d_25/kernel"}]}, {"paths": ["group26-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1, 75, 2], "name": "conv2d_26/kernel"}]}, {"paths": ["group27-shard1of1"], "weights": [{"dtype": "float32", "shape": [9, 20], "name": "dense_2/kernel"}]}, {"paths": ["group28-shard1of1"], "weights": [{"dtype": "float32", "shape": [18, 9], "name": "policy_head_1/kernel"}]}, {"paths": ["group29-shard1of1"], "weights": [{"dtype": "float32", "shape": [20, 1], "name": "value_head_1/kernel"}]}]}